package com.can.appstore.index.Data;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by liuhao on 2016/10/31.
 * 魏梦帆负责每天更新5个内涵段子
 */

public class JokeData {
    private static List<String> jokeList = new ArrayList<>();

    public static List<String> getJokeList() {
<<<<<<< HEAD
        jokeList.add("上学的时候，有一天 A君在宿舍准备换裤子，刚抽掉裤带，不料进来几个女生，没办法，他只好提着裤子来到隔壁宿舍。正解开扣子正要脱时，不料又进来几个女生，没办法，只好提着裤子来到下一个宿舍门口。因为他双手提着裤子，又很着急，只好一脚踹开宿舍门，同时大喊：“里面有没有女人?有没有女人?”只见屋里坐着一大堆女生，恐怖地望着他……-");
        jokeList.add("一女孩要跟男孩分手，男孩说，如果你和我分手，我就在你结婚那天，把咱俩的亲密视频刻成光盘邮寄给你老公，女孩被男孩的诚意打动，最终跟男孩结了婚。在结婚当天，男孩收到一盒光盘！= ");
        jokeList.add("今天一同事颠颠地跑过来小声跟我说：“我觉得你像古代的一位君王\"\"\n" +
                "　　我龙颜大悦问道：”朕像谁？”\n" +
                "　　“春秋时期的越王“\n" +
                "　　\"\"为什么？”\n" +
                "　　“因为你够贱“尼玛是不是不想活了！");
        jokeList.add("一对情侣甜蜜的在公园中依偎着，男的看到女的的头发如此柔顺，便忍不住偷摸了一下，女的娇滴滴的说：“唉呀！讨厌啦！”[ADS]\n" +
                "　　男的听了心更痒，于是又偷摸了一下，女的又说：“嗯，不要啦！”\n" +
                "　　男的一听，心都要飞起来了，又再摸了一下，突然那女的站起来，粗暴的说道：“不要摸了！我的假发都快掉了！！！”");
=======
        jokeList.add("　三岁的儿子从幼儿园回来气呼呼的对我说：“爸爸，老师一点都不好，总是凶我，中午还不拍拍我睡觉。”\n" +
                "　　我：“老师不可能像妈妈一样照顾那么多人的，你要听话。”\n" +
                "　　儿子：“让老师和妈妈换换就好了，妈妈每天在幼儿园陪我，老师在家陪爸爸睡觉。”\n" +
                "　　想想竟然有点激动呢");
        jokeList.add("上学时和同学一起去打热水，回宿舍路上暖瓶吱吱的响。\n" +
                "　　我说：“不好要炸啦。”\n" +
                "　　这哥们嗖的一声把暖瓶扔出去了，嘭，果然炸了。\n" +
                "　　这哥们心有余悸的说：“还好我扔的快，没炸到我。");
        jokeList.add("老师提问小明：“你知道西班牙的国王是谁吗？”\n" +
                "　　小明：“嗯，我不知道。”\n" +
                "　　老师：“那你今后一定要多花功夫在学习上啊！”\n" +
                "　　小明问：“老师，你知道贾翠花是谁吗？”\n" +
                "　　老师：“那是谁？我不知道。”\n" +
                "　　小明：“那你今后一定要多花功夫在老公身上啊！");
        jokeList.add("在外地打工回来，让媳妇来车站接我。\n" +
                "　　车晚点了就在车站附近一个宾馆住下了。\n" +
                "　　到前台我给钱的时候，媳妇说：“我有VIP卡！”\n" +
                "　　我一惊：“你怎么会有的？”\n" +
                "　　她说：“猜到今天晚上你肯定要带我来宾馆，所以就办了一张。”");
>>>>>>> canStore_v1.0
        jokeList.add("一男同学，冲出教室不小心摸到一位女同学的胸，刚想道歉。\n" +
                "　　只见女同学很生气的说：“真不要脸，乱摸人家胸。”\n" +
                "　　男同学立马整个人都不好了，回答道：“你有吗？我怎么没感觉啊！”\n" +
                "　　女生又问：“那你知道为什么地球是圆的，我们也没感觉到吗？那是因为它大！”");
        return jokeList;
    }

}
