package com.can.appstore.index.Data;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by liuhao on 2016/10/31.
 * 魏梦帆负责每天更新5个内涵段子
 */

public class JokeData {
    private static List<String> jokeList = new ArrayList<>();

    public static List<String> getJokeList() {
        jokeList.add("夜跑至郊外，听见有人在喊救命，走近一看，原来是一老大爷掉坑里了，我急忙把他拉了上来！…老大爷看着我笑道：小伙子，你真好心，我是神仙，可以给你重新再来一次的机会，你想要什么？…我想了想说：我要回昨天下午！…他手一挥，我马上回到了前一天的下午，我到了彩票点，看到奖池里的12亿奖金，我狂笑着买了300注本期中奖号码，当晚开奖，才发现那老头特么的是个骗子……");
        jokeList.add("佛说:今生的妻子，前世你埋的人，来还未报的恩。今生的儿子，前世你的债主，来追未还的债。今生的女儿，前世的你的情人，来了未了的情。今生的情人，是前世的夫妻，来续未尽的缘，今生的红颜，是前世的兄妹，来交未完的心。今世大贵之人，是前世的大善之人，来收前世结的德。这不是迷信，是因果，是定数。佛说:若无相欠，怎会相遇！");
        jokeList.add("昨天电梯故障，和媳妇儿一起爬楼梯！24楼啊！我的那个亲娘！爬到一半时，老妈打电话过来了！“儿子，下班没？”我喘着气说“下…下班了！”老妈:“你在干什么？听你喘得好厉害！”我正要回答，这时媳妇儿在旁边同样喘着粗气说:“老…老公…快…快点！”老妈听见“啪”就把电话挂了！~~");
        jokeList.add("和女神约好一起晚饭。吃完后，我们就分开了，刚走一会，就看到有人发短信给我，原来是女神发的。“口A田C甲D能告诉我答案吗？”我以为女神在开玩笑，就回了句“别闹了，到家没？”于是，女神就再也没有理我过？？？？");
        jokeList.add("某人得一宝贝： 紫砂壶， 每夜都放床头。 一次失手将紫砂壶 壶盖打翻到地上， 惊醒后 甚恼， 壶盖没了，留壶身何用？ 于是抓起壶扔到窗外。 天明， 发现壶盖 掉在棉鞋上，无损。 恨之，一脚把壶盖踩得粉碎。 出门，见昨晚扔出窗外的茶壶， 完好挂在树枝上…… 顿悟： 有时，事情可以: 等一等！看一看！缓一缓！ 因为----- 也许，很多事情并不是你以为的那样！ 学会冷静，是一种智慧！");
        return jokeList;
    }

}
